In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql sqlite:///library.db

'Connected: @library.db'

CREATE Item

In [91]:
%%sql
CREATE TABLE Item (
    ID INT PRIMARY KEY,
    title VARCHAR(255) NOT NULL,
    author VARCHAR(255) NOT NULL,
    edition VARCHAR(255),
    year YEAR,
    genre VARCHAR(255),
    quantity INT DEFAULT 0,
    numAvailable INT DEFAULT 0
);

 * sqlite:///library.db
Done.

[]

CREATE ItemCopy

In [92]:
%%sql 
CREATE TABLE ItemCopy (
    itemID INT REFERENCES Item(ID),
    copyNum INT,
    type VARCHAR (255) NOT NULL,
    status VARCHAR (255) NOT NULL,
    PRIMARY KEY (itemID, copyNum)
    CHECK ((status = 'Available' or status = 'Not Available')
           and (type = 'e-book' or type = 'audio book' or type = 'print'))
);

 * sqlite:///library.db
Done.

[]

CREATE FutureItem

In [25]:
%%sql
CREATE TABLE FutureItem (
    ID INT PRIMARY KEY,
    title VARCHAR(255) NOT NULL,
    author VARCHAR(255) NOT NULL,
    edition VARCHAR(255),
    year YEAR,
    genre VARCHAR(255),
    quantity INT DEFAULT 0,
    type VARCHAR(255) NOT NULL,
    arrivalDate date NOT NULL
);

 * sqlite:///library.db
Done.

[]

CREATE Person

In [35]:
%%sql
CREATE TABLE Person (
    ID INT PRIMARY KEY,
    firstName VARCHAR(255) NOT NULL,
    lastName VARCHAR(255) NOT NULL,
    age INT NOT NULL,
    owes INT DEFAULT 0
);

 * sqlite:///library.db
Done.

[]

CREATE Event

In [139]:
%%sql
CREATE TABLE Event (
    ID INT PRIMARY KEY,
    eventName VARCHAR (255) NOT NULL,
    date date NOT NULL,
    room INT NOT NULL,
    startTime TIME NOT NULL,
    endTime TIME NOT NULL,
    fee INT DEFAULT 0,
    recommendedAge VARCHAR(30) DEFAULT 'ANY'
);

 * sqlite:///library.db
Done.

[]

CREATE Registered

In [153]:
%%sql
CREATE TABLE Registered (
    personID INT REFERENCES Person(ID),
    eventID INT REFERENCES Event(ID),
    PRIMARY KEY (personID, eventID)
);

 * sqlite:///library.db
Done.

[]

CREATE CheckedOut

In [67]:
%%sql
CREATE TABLE CheckedOut (
    itemID INT REFERENCES ItemCopy(itemID),
    personID INT REFERENCES Person(ID),
    copyID INT REFERENCES ItemCopy(ID),
    PRIMARY KEY (personID, copyID, itemID)
);

 * sqlite:///library.db
Done.

[]

CREATE Dues

In [72]:
%%sql
CREATE TABLE Dues (
    itemID INT REFERENCES ItemCopy(itemID),
    personID INT REFERENCES CheckedOut(personID),
    copyID INT REFERENCES CheckedOut(copyID),
    dueDate VARCHAR(30) NOT NULL,
    PRIMARY KEY (itemID, personID, copyID)
);

 * sqlite:///library.db
Done.

[]

CREATE Staff

In [24]:
%%sql
CREATE TABLE Staff (
    ID INT PRIMARY KEY,
    firstName VARCHAR(255) NOT NULL,
    lastName VARCHAR(255) NOT NULL,
    age INT NOT NULL,
    gender VARCHAR(1),
    role VARCHAR(255) NOT NULL,
    CHECK (gender = 'F' OR gender = 'M') 
);

 * sqlite:///library.db
Done.

[]

POPULATE Item

In [95]:
%%sql
INSERT INTO Item (ID, title, author, edition, year, genre)
VALUES (1, 'Flowers for Algernon', 'Daniel Keyes', NULL, 1966, 'FIC'),
    (2, 'Illuminae', 'Amie Kaufman', NULL, 2015, 'FIC'),
    (3, 'Gemina', 'Amie Kaufman', NULL, 2016, 'FIC'),
    (4, 'Obsidio', 'Amie Kaufman', NULL, 2018, 'FIC'),
    (5, 'Scythe', 'Neal Shusterman', NULL, 2016, 'FIC'),
    (6, 'Thunderhead', 'Neal Shusterman', NULL, 2018, 'FIC'),
    (7, 'The Toll', 'Neal Shusterman', NULL, 2019, 'FIC'),
    (8, 'The Push', 'Tommy Caldwell', NULL, 2017, 'NON FIC'),
    (9, 'Gripped', 'Assorted', 'March', 2018, 'NON FIC'),
    (10, 'Five Ingredient Vegan', 'Katy Beskow', NULL, 2020, 'NON FIC')

 * sqlite:///library.db
10 rows affected.

[]

POPULATE ItemCopy

In [96]:
%%sql
INSERT INTO ItemCopy (itemID, copyNum, type, status)
VALUES (1, 1, 'print', 'Available'),
    (1, 2, 'print', 'Available'),
    (2, 1, 'print', 'Available'),
    (3, 1, 'print', 'Available'),
    (4, 1, 'print', 'Available'),
    (5, 1, 'print', 'Available'),
    (6, 1, 'print', 'Available'),
    (7, 1, 'print', 'Available'),
    (8, 1, 'print', 'Available'),
    (9, 1, 'print', 'Available'),
    (10, 1, 'print', 'Available'),
    (10, 2, 'e-book', 'Available')

 * sqlite:///library.db
12 rows affected.

[]

POPULATE FutureItem

In [37]:
%%sql
INSERT INTO FutureItem (ID, title, author, edition, year, genre, quantity, type, arrivalDate)
VALUES (100, 'Harry Potter and the The Philosophers Stone', 'J.K. Rowling', 'NULL', 1997, 'FIC', 10, 'print', '05-23-2021'),
    (101, 'Harry Potter and The Chamber of Secrets', 'J.K. Rowling', 'NULL', 1998, 'FIC', 10, 'print', '05-23-2021'),
    (102, 'Harry Potter and The Prisoner of Azkaban', 'J.K. Rowling', 'NULL', 1999, 'FIC', 10, 'print', '05-23-2021'),
    (103, 'Harry Potter and The Goblet of Fire', 'J.K. Rowling', 'NULL', 2000, 'FIC', 10, 'print', '05-23-2021'),
    (104, 'Harry Potter and The Order of the Phoenix', 'J.K. Rowling', 'NULL', 2003, 'FIC', 10, 'print', '05-23-2021'),
    (105, 'Harry Potter and The Half-Blood Prince', 'J.K. Rowling', 'NULL', 2005, 'FIC', 10, 'print', '05-23-2021'),
    (106, 'Harry Potter and The Deathly Hallows', 'J.K. Rowling', 'NULL', 2007, 'FIC', 10, 'print', '05-23-2021'),
    (107, 'Harry Potter and Quidditch Through the Ages', 'J.K. Rowling', 'NULL', 2001, 'FIC', 10, 'print', '05-23-2021'),
    (108, 'Harry Potter and Fantastic Beasts and Where to Find Them', 'J.K. Rowling', 'NULL', 2001, 'FIC', 10, 'print', '05-23-2021'),
    (109, 'Harry Potter and The Tales of Beedle the Bard', 'J.K. Rowling', 'NULL', 2007, 'FIC', 10, 'print', '05-23-2021')

 * sqlite:///library.db
9 rows affected.

[]

POPULATE Person

In [36]:
%%sql
INSERT INTO Person (ID, firstName, lastName, age)
VALUES (1, 'Meredeth', 'Aldrich', 29),
    (2, 'Isiahi', 'Mitchelson', 21),
    (3, 'Florian', 'Fordyce', 16),
    (4, 'Penrod', 'Squirrel', 9),
    (5, 'Deck', 'Slane', 44),
    (6, 'Ciel', 'Gabbitus', 35),
    (7, 'Garvey', 'Burnside', 8),
    (8, 'Jewell', 'Yakunchikov', 26),
    (9, 'Marlane', 'De Goey', 40),
    (10, 'Mauricio', 'Fidell', 24)

 * sqlite:///library.db
10 rows affected.

[]

POPULATE Event

In [140]:
%%sql
INSERT INTO Event (ID, eventName, date, room, startTime, endTime, fee, recommendedAge)
VALUES (1, 'Book Club', '05-23-2020', 1, '19:00', '20:00', 0, 'ANY'),
    (2, 'Resume Workshop', '05-23-2020', 2, '07:00', '08:00', 0, 'ANY'),
    (3, 'Book Club', '05-30-2020', 1, '19:00', '20:00', 0, 'ANY'),
    (4, 'Tech Workshop', '06-3-2020', 5, '09:00', '10:00', 0, 'ANY'),
    (5, 'Book Club', '06-07-2020', 1, '19:00', '20:00', 0, 'ANY'),
    (6, 'Story Time', '05-23-2020', 1, '13:00', '14:00', 0, 'Children age 2-5'),
    (7, 'Book Club', '06-14-2020', 1, '19:00', '20:00', 0, 'ANY'),
    (8, 'Book Signing', '06-15-2020', 3, '08:00', '09:00', 0, 'ANY'),
    (9, 'Interview Workshop', '06-19-2020', 2, '07:00', '08:00', 0, 'ANY'),
    (10, 'Book Club', '06-21-2020', 1, '19:00', '20:00', 0, 'ANY')

 * sqlite:///library.db
10 rows affected.

[]

POPULATE Registered

In [154]:
%%sql
INSERT INTO Registered (eventID, personID)
VALUES (1,1),
    (2,3),
    (3,1),
    (4,3),
    (5,1),
    (6,5),
    (7,2),
    (8,4),
    (9,3),
    (10,1)

 * sqlite:///library.db
10 rows affected.

[]

POPULATE Staff

In [158]:
%%sql
INSERT INTO Staff (ID, firstName, lastName, age, gender, role)
VALUES (1, 'Fairlie', 'Hender', 23, 'M', 'Librarian'),
    (2, 'Laurence', 'Waudby', 43, 'M', 'Custodian'),
    (3, 'Royall', 'Mottley',30, 'M', 'IT'),
    (4, 'Peta', 'Brahan', 28, 'F', 'Librarian'),
    (5, 'Godwin', 'Dacey', 42, 'M', 'Custodian'),
    (6, 'Ofilia', 'Crichmer', 38, 'F', 'Security'),
    (7, 'Theresina', 'Dufoure', 27, 'F', 'Manager'),
    (8, 'Isa', 'Songhurst', 20, 'M', 'Librarian'),
    (9, 'Starla', 'Ling', 18, 'F', 'Book Shelver'),
    (10, 'Kimmy', 'Whitlam', 47, 'F', 'Receptionist')

 * sqlite:///library.db
10 rows affected.

[]